In [2]:
import pandas as pd

In [3]:
file_to_load = "Resources/purchase_data.csv"
purchase_data = pd.read_csv(file_to_load)

In [4]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [21]:
purchases_count = len(purchase_data)
print(purchases_count)

780

In [22]:
unique_items = purchase_data["Item Name"].unique()
unique_items_num = len(unique_items)
print(unique_items_num)

179

In [23]:
avg_item_price = purchase_data["Price"].mean()
print(avg_item_price)

3.050987179487176

In [25]:
players = purchase_data["SN"].unique()
player_count = len(players)
print(player_count)

576

In [24]:
total_revenue = purchase_data["Price"].sum()
print(total_revenue)

2379.77

In [47]:
print("--------------------------------------------")
print("Heroes of Pymoli - Sales Summary")
print("--------------------------------------------")

summary = pd.DataFrame({"Player count":[player_count], "Purchases":[purchases_count], "Unique Items":[unique_items_num], "Average Item Price":[avg_item_price], "Total Revenue":[total_revenue]})
summary.head()

--------------------------------------------
Heroes of Pymoli - Sales Summary
--------------------------------------------

   Player count  Purchases  Unique Items  Average Item Price  Total Revenue
0           576        780           179            3.050987        2379.77

In [173]:
data_demographics = purchase_data.copy()
renamed_df = data_demographics[["SN", "Gender"]]
droppedvalues = renamed_df.drop_duplicates(subset ="SN",keep = "first")
# renamed_df2 = droppedvalues[["Gender"]]
# gender = renamed_df2.count()
gender_group = droppedvalues.groupby(["Gender"])
gender_summary = gender_group.count()

gender_summary = gender_group.count()
gender_summary["Percent"] = gender_summary.sum(axis=1)
gender_summary["Percent"] = gender_summary["Percent"] / player_count *100
summary_gender = gender_summary.rename(columns={"SN":"User Count"})

In [174]:
summary_gender = summary_gender.reset_index()
summary_gender

                  Gender  User Count    Percent
0                 Female          81  14.062500
1                   Male         484  84.027778
2  Other / Non-Disclosed          11   1.909722

In [175]:
gender_df = purchase_data[["Gender", "Price"]]

In [176]:
new_df = gender_df.groupby(["Gender"])
aa = new_df.sum()
a = aa.rename(columns={"Price":"Total Revenue"})
a

                       Total Revenue
Gender
Female                        361.94
Male                         1967.64
Other / Non-Disclosed          50.19

In [170]:
bb = new_df.mean()
b = bb.rename(columns={"Price":"Avg Purchase Price"})
b

                       Avg Purchase Price
Gender
Female                           3.203009
Male                             3.017853
Other / Non-Disclosed            3.346000

In [187]:
cc = new_df.count()
c = cc.rename(columns={"Price":"Purchase Count"})
c = c.reset_index()
c

                  Gender  Purchase Count
0                 Female             113
1                   Male             652
2  Other / Non-Disclosed              15

In [188]:
c = c.merge(b,on="Gender")
c = c.merge(a,on="Gender")

c = c.merge(summary_gender,on="Gender")

c["Avg Total Purchase per Person"] = c["Total Revenue"]/c["User Count"]

c

,Gender,Purchase Count,Avg Purchase Price,Total Revenue,User Count,Percent,Avg Total Purchase per Person
0,Female,113,3.203009,361.94,81,14.062500,4.468395
1,Male,652,3.017853,1967.64,484,84.027778,4.065372
2,Other / Non-Disclosed,15,3.346000,50.19,11,1.909722,4.562727

In [194]:
d = c[["Gender", "Purchase Count", "Avg Purchase Price", "Total Revenue","Avg Total Purchase per Person"]]
d

,Gender,Purchase Count,Avg Purchase Price,Total Revenue,Avg Total Purchase per Person
0,Female,113,3.203009,361.94,4.468395
1,Male,652,3.017853,1967.64,4.065372
2,Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80